// 서술형은 각 문제 아래에 서술할 것.

// 1. 동기와 비동기 처리에 대하여 설명하라.
// 동기는 프로그램의 실행과 결과가 동시에 일어나는 것을 말한다. 쉽게 말해 실행이 되었으면 결과가 일어나야 다른 작업이 가능하다는 것. 비동기는 그의 반대이다. 예를 들어 동시에 두개의 게임을 한다고 가정했을 때,  한 개의 게임을 끝내고 다른 게임을 실행할 수 있는 것이 동기, 동시에 두 개의 게임을 모두 실행할 수 있는 것이 비동기처리이다.

// 2. 싱글 스레드와 멀티 스레드에 대하여 설명하라.
// 싱글 스레드는 한 매니저 밑에 한 명의 알바생만 고용 가능
// 멀티 스레드는 한 매니저 밑에 두 명이상의 알바생 고용 가능

// 3. 쿠키와 세션, 로컬저장소의 차이점에 대하여 설명하라.
// 쿠키 : 클라이언트의 정보를 클라이언트의 컴퓨터에 기록하는 파일
// 세션 : 클라이언트의 요청을 하나의 상태로 보고 유지시키는 기술?
// 로컬저장소 : 내 PC저장소

// 4. 콜백지옥이 무엇이고 이것을 해결하기 위한 방안은 무엇인지 설명하라.
// Promise then을 사용해 함수 실행순서를 지정하거나 async await를 사용한다

// 5. Node.js 이벤트 큐 동작원리에 대하여 설명하라.

// 6. GET, POST 방식에 대하여 설명하라.
// GET : 서버에 데이터를 요청할 때 사용하는 방식
// POST : 서버의 데이터를 생성하거나 수정, 업데이트 할때 사용하는 방식

// 7. 자바스크립트의 배열이 실제 자료구조 배열이 아닌데 그 이유는 무엇인가?

// 8. http와 https의 차이점은 무엇인가?
// 암호화를 할 수 있느냐의 차이.
// http는 암호화를 하지 않고 데이터를 주고받아 해킹의 위험이 높아져 그것을 해결하기위한 것이 https

// 9. 브라우저 렌더링 과정에 대하여 설명하라.
// 모름

// 10. 호이스팅이 무엇인지 서술하라.
// 변수를 선언하기 이전에 할당하는 것
